garyPenhook/PyAvrOCD/svd/avr32eb20.svd
        <register>
          <name>LUT3CTRLC</name>
          <description>LUT 3 Control C</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL2</name>
              <description>LUT Input 2 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Output from LUT[n+1] as input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event A as input source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event B as input source</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>IN2 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1</name>
                  <description>AC1 output input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>USART0 TxD input source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 SCK input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0</name>
                  <description>TCE0 WO2 input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1</name>
                  <description>TCB1 WO input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0</name>
                  <description>TCF0 WO0 input source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEX0</name>
                  <description>Blanking input source</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL0</name>
          <description>Sequential Control 0</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL1</name>
          <description>Sequential Control 1</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH0</name>
          <description>Truth 0</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH1</name>
          <description>Truth 1</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH2</name>
          <description>Truth 2</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH3</name>
          <description>Truth 3</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
